# PythonSetSearchPath

## Description
Set the search path for python files.

```pascal
PROCEDURE PythonSetSearchPath(pathList : DYNARRAY[] of CHAR);
```

```python

def vs.PythonSetSearchPath(pathList):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pathList|DYNARRAY[] of CHAR|A string of semicolon delimited paths. The path it similar to the 'Open' function path parameter.|

## See Also
VS Functions:
PythonGetSearchPath| PythonExecute

## Version
Availability: from Vectorworks 2014
## Category
* Utility